---
kind: type
id: T:Autodesk.Revit.DB.NavisworksExportOptions
source: html/a58dbe71-1be7-dad6-51b6-5386c162cf87.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions

Options which controls the Navisworks export.

## Syntax (C#)
```csharp
public class NavisworksExportOptions : IDisposable
```